In [3]:
import pandas as ps

In [4]:
df = {'Name':('Faiz','Khanif','Rahul'),
    'Age':(20,30,31),
      'Salary':(25000,30000,10000)}
data = ps.DataFrame(df)

In [5]:
data

     Name  Age  Salary
0    Faiz   20   25000
1  Khanif   30   30000
2   Rahul   31   10000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [7]:
data.describe()

             Age        Salary
count   3.000000      3.000000
mean   27.000000  21666.666667
std     6.082763  10408.329997
min    20.000000  10000.000000
25%    25.000000  17500.000000
50%    30.000000  25000.000000
75%    30.500000  27500.000000
max    31.000000  30000.000000

In [8]:
data['Joining_Age'] = [19,30,35]

In [9]:
data

     Name  Age  Salary  Joining_Age
0    Faiz   20   25000           19
1  Khanif   30   30000           30
2   Rahul   31   10000           35

In [10]:
data['Emp_id'] = [100,101,102]
data

     Name  Age  Salary  Joining_Age  Emp_id
0    Faiz   20   25000           19     100
1  Khanif   30   30000           30     101
2   Rahul   31   10000           35     102

In [20]:
data = data.set_index('Emp_id')

In [21]:
data

          Name  Age  Salary  Joining_Age
Emp_id
100       Faiz   20   25000           19
101     Khanif   30   30000           30
102      Rahul   31   10000           35

In [23]:
data=data.reset_index('Emp_id')

In [24]:
data.loc[0]

Emp_id           100
Name            Faiz
Age               20
Salary         25000
Joining_Age       19
Name: 0, dtype: object

In [29]:
data

   Emp_id    Name  Age  Salary  Joining_Age
0     100    Faiz   20   25000           19
1     101  Khanif   30   30000           30
2     102   Rahul   31   10000           35

In [38]:
data.loc[:,'Age']

0    20
1    30
2    31
Name: Age, dtype: int64

In [40]:
data.loc[1,'Name']

'Khanif'

In [51]:
data.loc[0:2,'Salary']

0    25000
1    30000
2    10000
Name: Salary, dtype: int64

In [43]:
data

   Emp_id    Name  Age  Salary  Joining_Age
0     100    Faiz   20   25000           19
1     101  Khanif   30   30000           30
2     102   Rahul   31   10000           35

In [44]:
data.iloc[2]

Emp_id           102
Name           Rahul
Age               31
Salary         10000
Joining_Age       35
Name: 2, dtype: object

In [45]:
data.iloc[:,0]

0    100
1    101
2    102
Name: Emp_id, dtype: int64

In [52]:
data.iloc[1:2,1:2]

     Name
1  Khanif